backwardFacingStep2D_SpalartAllmaras/system/fvSolution
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  v2312                                 |
|   \\  /    A nd           | Website:  www.openfoam.com                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    object      fvSolution;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

solvers
{
     p
      {
          solver          GAMG;
          tolerance       1e-06;
          relTol          0.1;
          smoother        GaussSeidel;
      }

      pFinal
      {
          $p;
          tolerance       1e-06;
          relTol          0;
      }

    "(U|k|epsilon|omega|nuTilda)"
    {
        solver          smoothSolver;
        smoother        symGaussSeidel;
        tolerance       1e-10;
        relTol          1e-6;
    }
}

PISO
{
    nNonOrthogonalCorrectors 1;
    nCorrectors              2;

}

relaxationFactors
{
    equations
    {
        U               0.9;
        ".*"            0.8;
    }
}


// ************************************************************************* //
